tap "eth-p/software"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Shell plugin manager
brew "antibody"
# Library for manipulating PNG images
brew "libpng"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Convert CD images from .bin/.cue to .iso/.cdr
brew "bchunk"
# Mozilla CA certificate store
brew "ca-certificates"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg@1.4"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# CLI for ImageOptim, ImageAlpha and JPEGmini
brew "imageoptim-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Parallel bzip2
brew "pbzip2"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql", restart_service: true
# Python version management
brew "pyenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Sound and music editor
cask "ableton-live-suite"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
cask "font-fira-code"
# Audio converter and CD ripper
cask "freac"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Software for Logitech devices
cask "logitech-options"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Web development solution with Apache, Nginx, PHP & MySQL
cask "mamp"
# Timer application
cask "michaelvillar-timer"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
cask "mipony"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Collaboration platform for API development
cask "postman"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "webpquicklook"
# Desktop client for WhatsApp
cask "whatsapp"
mas "BetterSnapTool", id: 417375580
mas "Spike", id: 707452888
